/*
  +----------------------+
  |       News           |
  +----------------------+
*/

insert into news(id, title, description, created_at, poster_url)
values (-1, 'Паводки: что происходит в Казахстане', 'По официальным данным, за прошедшие сутки подразделениями радиационной, химической и биологической защиты Министерства по чрезвычайным ситуациям в Кызылжарском районе Северо-Казахстанской области проведена дезинфекция подтопленных 97 домов, в городе Кульсары и Жылыойском районе Атырауской области - подтопленных двух многоэтажных жилых домов и территории. ' ||
           'Силами войсковой части Министерства обороны в пригородных территориях Уральска Западно-Казахстанской области проведена аналогичная работа подтопленных территорий общей площадью 65,2 гектара. ' ||
           'По республике отведена и откачана вода из 9 660 жилых домов и 3 213 дворовых территорий. Откачано 16,2 миллиона кубометров талой воды. Вернулись в свои дома 50 467 человек. 5 447 человек остаются в пунктах временного размещения. В противопаводковых работах задействовано 11 458 человек и 1 289 единиц техники, 329 водооткачивающих средств и 68 плавательных средств, 6 воздушных судов.',
            '2024-05-05', 'https://tengrinews.kz/userdata/news/2024/news_534514/thumb_b/photo_471354.jpeg');

insert into news(id, title, description, created_at, poster_url)
values (-2, 'Больше 50 тысяч казахстанцев вернулись в свои дома.', '50 467 человек, эвакуированных из-за паводка, вернулись в свои дома, сообщил представитель МЧС РК Аскар Шарип на брифинге в СЦК. ' ||
           'По его словам, 5447 человек остаются в пунктах временного размещения. По республике отвели и откачали воду из 9 660 жилых домов и с 3213 дворовых территорий. За прошедшие сутки в Северо-Казахстанской области провели дезинфекцию в 97 подтопленных домах, в Кульсары и Жылыойском районе Атырауской области – в двух многоэтажных жилых домах. В пригороде Уральска провели аналогичные работы на территории площадью 65 га. ' ||
           'В противопаводковых работах участвуют 11 458 человек.',
            '2024-05-05', 'https://tengrinews.kz/userdata/news/2024/news_534307/thumb_b/photo_471121.jpeg');

insert into news(id, title, description, created_at, poster_url)
values (-3, 'Паводки в Казахстане: о ситуации рассказали в МЧС', 'Как отметил представитель ведомства Аскар Шарип, в городе Кульсары Атырауской области продолжается откачка воды из оставшихся 20 подтопленных домов в круглосуточном режиме с применением мотопомп и мощных передвижных насосных станций. Военнослужащие воинской части 20982 МЧС проводят дезинфекционные работы в Кульсары. В Петропавловске и Кызылжарском районе Северо-Казахстанской области за сутки отведена и откачана вода из 184 домов. Всего по республике отведена и откачана вода из 8 958 жилых домов и 2 994 дворовых территорий. Вернулись в свои дома 49 945 человек.',
            '2024-05-05', 'https://tengrinews.kz/userdata/news/2024/news_534408/thumb_b/photo_471226.jpeg');

insert into news(id, title, description, created_at, poster_url)
values (-4, '"Точность 97 процентов": смогут ли в Казахстане предсказывать паводки и пожары', 'Напомним, что ранее в ходе заседания республиканского штаба по координации противопаводковых мероприятий и ликвидации последствий паводков Глава государства заявил, что государственные структуры "проснулись и вдруг обнаружили, что наступили паводки". По его словам, прогнозно-аналитическая работа госорганов организована слабо. Он поручил МЧС, Минцифры и другим структурам разработать информационную систему, которая позволит моделировать все возможные чрезвычайные ситуации (паводки, пожары и другие), составлять соответствующие прогнозы, рекомендации и шаги действий. ' ||
            'В ответ на запрос редакции по поводу информационной системы, которая позволит моделировать паводки, пожары, потопы и другие опасные явления, в МЧС сообщили, что в разработке информационной системы (с моделированием возможных ЧС) будет учтен весь функционал, необходимый для оперативного реагирования и своевременного снижения риска чрезвычайных ситуаций, включая передовой мировой опыт. В МЧС считают, что она станет инструментом для безопасности людей в регионах, подверженных природным бедствиям. Более обширного ответа в МЧС получить не удалось',
            '2024-05-05', 'https://tengrinews.kz/userdata/news/2024/news_534286/thumb_b/photo_471092.jpeg');

insert into news(id, title, description, created_at, poster_url)
values (-5, 'Кадры из затопленного Петропавловска', 'В тот день в Подгоре было очень оживленно и тревожно - спасатели в рупор предупреждали о срочной эвакуации, встревоженно лаяли собаки, люди вывозили вещи, а возле храма было тихо и спокойно. О предстоящей беде говорило разве только объявление, наклеенное спасателями на забор храма.' ||
            'К слову, и сами жители Подгоры еще пару дней назад были вполне спокойны. Кто-то отказывался эвакуироваться, другие собирали вещи и уезжали, но считали это перестраховкой властей и служб.',
            '2024-05-05', 'https://tengrinews.kz/userdata/u138/2024-04/resize/000d18de684bbcbf7db0a45188bd55e8.jpeg');


/*
  +----------------------+
  |       Programs       |
  +----------------------+
*/

insert into programs(id, type, title, description, poster_url, created_at, max_amount, current_amount)
values (-1, 0, 'Волонтёрство', 'В Южной столице открыт пункт приема гуманитарной помощи для пострадавших от наводнения. ' ||
'В Алматы открыт пункт сбора гуманитарной помощи для пострадавших от наводнения в разных регионах Казахстана. Об этом сообщила пресс-служба акимата южной столицы.
Граждане могут сдать вещи в общественный центр Алмалинского района по адресу: Байтурсынова, 22/1. ' ||
'Часы приема - с 10.00 до 19.00.
Акимат Алматы также опубликовал список, по которому принимается гуманитарная помощь:
Еда;
питьевая вода;
медикаменты и расходные материалы;
одежда (теплые вещи, обувь, нижнее белье, носки и т.д.);
вещи (одеяла, спальные мешки, подушки и т.д.);
товары для дома (палатки, матрасы, термосы, фонарики, аккумуляторы, чайники, детская посуда, пустышки и многое другое);
средства гигиены (подгузники, средства женской гигиены, мыло, зубная паста, шампуни, салфетки, туалетная бумага, моющие средства и т.д.).',
'https://img.freepik.com/premium-vector/flood-rescue-teams-are-helping-children-women-out-floods_353206-207.jpg', '2024-05-05',
1000000, 644243);

insert into programs(id, type, title, description, poster_url, created_at, max_amount, current_amount)
values (-2, 1, 'Помощь пострадавшим от наводнения', 'В Южной столице открыт пункт приема гуманитарной помощи для пострадавших от наводнения. ' ||
'В Алматы открыт пункт сбора гуманитарной помощи для пострадавших от наводнения в разных регионах Казахстана. Об этом сообщила пресс-служба акимата южной столицы.
Граждане могут сдать вещи в общественный центр Алмалинского района по адресу: Байтурсынова, 22/1. ' ||
'Часы приема - с 10.00 до 19.00.
Акимат Алматы также опубликовал список, по которому принимается гуманитарная помощь:
Еда;
питьевая вода;
медикаменты и расходные материалы;
одежда (теплые вещи, обувь, нижнее белье, носки и т.д.);
вещи (одеяла, спальные мешки, подушки и т.д.);
товары для дома (палатки, матрасы, термосы, фонарики, аккумуляторы, чайники, детская посуда, пустышки и многое другое);
средства гигиены (подгузники, средства женской гигиены, мыло, зубная паста, шампуни, салфетки, туалетная бумага, моющие средства и т.д.).',
'https://img.freepik.com/free-vector/tiny-volunteers-sharing-canned-food-grocery-products-help-support-assistance-from-people-with-charity-cardboard-box-flat-vector-illustration-voluntary-delivery-humanitarian-aid-concept_74855-22077.jpg', '2024-05-05',
1000000, 644243);

insert into programs(id, type, title, description, poster_url, created_at, max_amount, current_amount)
values (-3, 2, 'Пункт сбора гуманитарной помощи', 'В Южной столице открыт пункт приема гуманитарной помощи для пострадавших от наводнения. ' ||
'В Алматы открыт пункт сбора гуманитарной помощи для пострадавших от наводнения в разных регионах Казахстана. Об этом сообщила пресс-служба акимата южной столицы.
Граждане могут сдать вещи в общественный центр Алмалинского района по адресу: Байтурсынова, 22/1. ' ||
'Часы приема - с 10.00 до 19.00.
Акимат Алматы также опубликовал список, по которому принимается гуманитарная помощь:
Еда;
питьевая вода;
медикаменты и расходные материалы;
одежда (теплые вещи, обувь, нижнее белье, носки и т.д.);
вещи (одеяла, спальные мешки, подушки и т.д.);
товары для дома (палатки, матрасы, термосы, фонарики, аккумуляторы, чайники, детская посуда, пустышки и многое другое);
средства гигиены (подгузники, средства женской гигиены, мыло, зубная паста, шампуни, салфетки, туалетная бумага, моющие средства и т.д.).',
'https://img.freepik.com/free-vector/cartoon-world-humanitarian-day-illustration_23-2148996147.jpg', '2024-05-05',
1000000, 644243);